<a href="https://colab.research.google.com/github/KamilBienias/data-science/blob/main/kursPawe%C5%82Krakowiak/pandas_course/05_merge_join_concatenate/04_merge_more.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
# -*- coding: utf-8 -*-

"""
@author: krakowiakpawel9@gmail.com
@site: e-smartdata.org
"""

import pandas as pd

In [7]:
# id_trans to id transakcji

d1 = {'date': ['2019-01-01', '2019-01-01', '2019-01-02', '2019-01-02'],
      'id_trans': ['0001', '0002', '0003', '0004'],
      'product_id': ['343', '523', '151', '522']}

d2 = {'date': ['2019-01-01', '2019-01-02', '2019-01-02', '2019-01-03'],
      'id_trans': ['0001', '0002', '0003', '0004'],
      'price': ['99', '149', '59', '199']}

In [8]:
# DataFrame o nazwie left ma kolumnę product_id, ale nie ma price
left = pd.DataFrame(d1)
left

         date id_trans product_id
0  2019-01-01     0001        343
1  2019-01-01     0002        523
2  2019-01-02     0003        151
3  2019-01-02     0004        522

In [9]:
# DataFrame o nazwie right ma kolumnę price, ale nie ma product_id
right = pd.DataFrame(d2)
right

         date id_trans price
0  2019-01-01     0001    99
1  2019-01-02     0002   149
2  2019-01-02     0003    59
3  2019-01-03     0004   199

In [10]:
# %% how='inner'. Kluczem łączenia są kolumny z parametru on
df_inner = pd.merge(left, right, how='inner', on=['date', 'id_trans'])
df_inner

         date id_trans product_id price
0  2019-01-01     0001        343    99
1  2019-01-02     0003        151    59

In [11]:
# %% how='outer'
df_outer = pd.merge(left, right, how='outer', on=['date', 'id_trans'])
df_outer

         date id_trans product_id price
0  2019-01-01     0001        343    99
1  2019-01-01     0002        523   NaN
2  2019-01-02     0003        151    59
3  2019-01-02     0004        522   NaN
4  2019-01-02     0002        NaN   149
5  2019-01-03     0004        NaN   199

In [12]:
# %% how='left'
df_left = pd.merge(left, right, how='left', on=['date', 'id_trans'])
df_left

         date id_trans product_id price
0  2019-01-01     0001        343    99
1  2019-01-01     0002        523   NaN
2  2019-01-02     0003        151    59
3  2019-01-02     0004        522   NaN

In [13]:
# %% how='right'
df_right = pd.merge(left, right, how='right', on=['date', 'id_trans'])
df_right

         date id_trans product_id price
0  2019-01-01     0001        343    99
1  2019-01-02     0002        NaN   149
2  2019-01-02     0003        151    59
3  2019-01-03     0004        NaN   199